### 📦 Plan for `sbx/eu-west-1/ecr`
```hcl
08:09:13.759 STDOUT terraform: Terraform used the selected providers to generate the following execution
08:09:13.760 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
08:09:13.760 STDOUT terraform:   + create
08:09:13.760 STDOUT terraform: Terraform will perform the following actions:
08:09:13.760 STDOUT terraform:   # aws_ecr_lifecycle_policy.default_policy["microservice-a"] will be created
08:09:13.760 STDOUT terraform:   + resource "aws_ecr_lifecycle_policy" "default_policy" {
08:09:13.760 STDOUT terraform:       + id          = (known after apply)
08:09:13.760 STDOUT terraform:       + policy      = jsonencode(
08:09:13.760 STDOUT terraform:             {
08:09:13.760 STDOUT terraform:               + rules = [
08:09:13.760 STDOUT terraform:                   + {
08:09:13.760 STDOUT terraform:                       + action       = {
08:09:13.760 STDOUT terraform:                           + type = "expire"
08:09:13.760 STDOUT terraform:                         }
08:09:13.760 STDOUT terraform:                       + description  = "Remove untagged images after 3 days."
08:09:13.760 STDOUT terraform:                       + rulePriority = 1
08:09:13.760 STDOUT terraform:                       + selection    = {
08:09:13.760 STDOUT terraform:                           + countNumber = 3
08:09:13.760 STDOUT terraform:                           + countType   = "sinceImagePushed"
08:09:13.760 STDOUT terraform:                           + countUnit   = "days"
08:09:13.760 STDOUT terraform:                           + tagStatus   = "untagged"
08:09:13.761 STDOUT terraform:                         }
08:09:13.761 STDOUT terraform:                     },
08:09:13.761 STDOUT terraform:                   + {
08:09:13.761 STDOUT terraform:                       + action       = {
08:09:13.761 STDOUT terraform:                           + type = "expire"
08:09:13.761 STDOUT terraform:                         }
08:09:13.761 STDOUT terraform:                       + description  = "Remove images created by pull-requests older than 7 days."
08:09:13.761 STDOUT terraform:                       + rulePriority = 2
08:09:13.761 STDOUT terraform:                       + selection    = {
08:09:13.761 STDOUT terraform:                           + countNumber    = 7
08:09:13.761 STDOUT terraform:                           + countType      = "imageCountMoreThan"
08:09:13.761 STDOUT terraform:                           + tagPatternList = [
08:09:13.761 STDOUT terraform:                               + "*pull_request*",
08:09:13.761 STDOUT terraform:                             ]
08:09:13.761 STDOUT terraform:                           + tagStatus      = "tagged"
08:09:13.761 STDOUT terraform:                         }
08:09:13.761 STDOUT terraform:                     },
08:09:13.761 STDOUT terraform:                   + {
08:09:13.761 STDOUT terraform:                       + action       = {
08:09:13.761 STDOUT terraform:                           + type = "expire"
08:09:13.761 STDOUT terraform:                         }
08:09:13.761 STDOUT terraform:                       + description  = "Expire images older than 50 days."
08:09:13.761 STDOUT terraform:                       + rulePriority = 3
08:09:13.761 STDOUT terraform:                       + selection    = {
08:09:13.761 STDOUT terraform:                           + countNumber = 50
08:09:13.761 STDOUT terraform:                           + countType   = "imageCountMoreThan"
08:09:13.761 STDOUT terraform:                           + tagStatus   = "any"
08:09:13.762 STDOUT terraform:                         }
08:09:13.762 STDOUT terraform:                     },
08:09:13.762 STDOUT terraform:                 ]
08:09:13.762 STDOUT terraform:             }
08:09:13.762 STDOUT terraform:         )
08:09:13.762 STDOUT terraform:       + registry_id = (known after apply)
08:09:13.762 STDOUT terraform:       + repository  = "microservice-a"
08:09:13.762 STDOUT terraform:     }
08:09:13.762 STDOUT terraform:   # aws_ecr_lifecycle_policy.default_policy["microservice-b"] will be created
08:09:13.762 STDOUT terraform:   + resource "aws_ecr_lifecycle_policy" "default_policy" {
08:09:13.762 STDOUT terraform:       + id          = (known after apply)
08:09:13.762 STDOUT terraform:       + policy      = jsonencode(
08:09:13.762 STDOUT terraform:             {
08:09:13.762 STDOUT terraform:               + rules = [
08:09:13.762 STDOUT terraform:                   + {
08:09:13.762 STDOUT terraform:                       + action       = {
08:09:13.762 STDOUT terraform:                           + type = "expire"
08:09:13.762 STDOUT terraform:                         }
08:09:13.762 STDOUT terraform:                       + description  = "Remove untagged images after 3 days."
08:09:13.762 STDOUT terraform:                       + rulePriority = 1
08:09:13.762 STDOUT terraform:                       + selection    = {
08:09:13.762 STDOUT terraform:                           + countNumber = 3
08:09:13.762 STDOUT terraform:                           + countType   = "sinceImagePushed"
08:09:13.762 STDOUT terraform:                           + countUnit   = "days"
08:09:13.762 STDOUT terraform:                           + tagStatus   = "untagged"
08:09:13.762 STDOUT terraform:                         }
08:09:13.762 STDOUT terraform:                     },
08:09:13.762 STDOUT terraform:                   + {
08:09:13.762 STDOUT terraform:                       + action       = {
08:09:13.762 STDOUT terraform:                           + type = "expire"
08:09:13.762 STDOUT terraform:                         }
08:09:13.762 STDOUT terraform:                       + description  = "Remove images created by pull-requests older than 7 days."
08:09:13.763 STDOUT terraform:                       + rulePriority = 2
08:09:13.763 STDOUT terraform:                       + selection    = {
08:09:13.763 STDOUT terraform:                           + countNumber    = 7
08:09:13.763 STDOUT terraform:                           + countType      = "imageCountMoreThan"
08:09:13.763 STDOUT terraform:                           + tagPatternList = [
08:09:13.763 STDOUT terraform:                               + "*pull_request*",
08:09:13.763 STDOUT terraform:                             ]
08:09:13.763 STDOUT terraform:                           + tagStatus      = "tagged"
08:09:13.763 STDOUT terraform:                         }
08:09:13.763 STDOUT terraform:                     },
08:09:13.763 STDOUT terraform:                   + {
08:09:13.763 STDOUT terraform:                       + action       = {
08:09:13.763 STDOUT terraform:                           + type = "expire"
08:09:13.763 STDOUT terraform:                         }
08:09:13.763 STDOUT terraform:                       + description  = "Expire images older than 50 days."
08:09:13.763 STDOUT terraform:                       + rulePriority = 3
08:09:13.763 STDOUT terraform:                       + selection    = {
08:09:13.763 STDOUT terraform:                           + countNumber = 50
08:09:13.763 STDOUT terraform:                           + countType   = "imageCountMoreThan"
08:09:13.763 STDOUT terraform:                           + tagStatus   = "any"
08:09:13.763 STDOUT terraform:                         }
08:09:13.763 STDOUT terraform:                     },
08:09:13.763 STDOUT terraform:                 ]
08:09:13.763 STDOUT terraform:             }
08:09:13.763 STDOUT terraform:         )
08:09:13.763 STDOUT terraform:       + registry_id = (known after apply)
08:09:13.763 STDOUT terraform:       + repository  = "microservice-b"
08:09:13.763 STDOUT terraform:     }
08:09:13.763 STDOUT terraform:   # aws_ecr_repository.ecr_repository["microservice-a"] will be created
08:09:13.764 STDOUT terraform:   + resource "aws_ecr_repository" "ecr_repository" {
08:09:13.764 STDOUT terraform:       + arn                  = (known after apply)
08:09:13.764 STDOUT terraform:       + id                   = (known after apply)
08:09:13.764 STDOUT terraform:       + image_tag_mutability = "MUTABLE"
08:09:13.764 STDOUT terraform:       + name                 = "microservice-a"
08:09:13.764 STDOUT terraform:       + registry_id          = (known after apply)
08:09:13.764 STDOUT terraform:       + repository_url       = (known after apply)
08:09:13.764 STDOUT terraform:       + tags                 = {
08:09:13.764 STDOUT terraform:           + "Environment" = "dev"
08:09:13.764 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:13.764 STDOUT terraform:         }
08:09:13.764 STDOUT terraform:       + tags_all             = {
08:09:13.764 STDOUT terraform:           + "Data-classification" = "internal"
08:09:13.764 STDOUT terraform:           + "Environment"         = "dev"
08:09:13.764 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:13.764 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:13.764 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:13.764 STDOUT terraform:         }
08:09:13.764 STDOUT terraform:       + image_scanning_configuration {
08:09:13.764 STDOUT terraform:           + scan_on_push = true
08:09:13.764 STDOUT terraform:         }
08:09:13.764 STDOUT terraform:     }
08:09:13.764 STDOUT terraform:   # aws_ecr_repository.ecr_repository["microservice-b"] will be created
08:09:13.764 STDOUT terraform:   + resource "aws_ecr_repository" "ecr_repository" {
08:09:13.764 STDOUT terraform:       + arn                  = (known after apply)
08:09:13.764 STDOUT terraform:       + id                   = (known after apply)
08:09:13.764 STDOUT terraform:       + image_tag_mutability = "MUTABLE"
08:09:13.764 STDOUT terraform:       + name                 = "microservice-b"
08:09:13.764 STDOUT terraform:       + registry_id          = (known after apply)
08:09:13.764 STDOUT terraform:       + repository_url       = (known after apply)
08:09:13.764 STDOUT terraform:       + tags                 = {
08:09:13.764 STDOUT terraform:           + "Environment" = "dev"
08:09:13.764 STDOUT terraform:           + "Terragrunt"  = "true"
08:09:13.764 STDOUT terraform:         }
08:09:13.764 STDOUT terraform:       + tags_all             = {
08:09:13.764 STDOUT terraform:           + "Data-classification" = "internal"
08:09:13.764 STDOUT terraform:           + "Environment"         = "dev"
08:09:13.764 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:09:13.764 STDOUT terraform:           + "Organization"        = "genopsx"
08:09:13.764 STDOUT terraform:           + "Terragrunt"          = "true"
08:09:13.764 STDOUT terraform:         }
08:09:13.765 STDOUT terraform:       + image_scanning_configuration {
08:09:13.765 STDOUT terraform:           + scan_on_push = true
08:09:13.765 STDOUT terraform:         }
08:09:13.765 STDOUT terraform:     }
08:09:13.765 STDOUT terraform: Plan: 4 to add, 0 to change, 0 to destroy.
08:09:13.765 STDOUT terraform: Changes to Outputs:
08:09:13.765 STDOUT terraform:   + repositories_arns = {
08:09:13.765 STDOUT terraform:       + microservice-a = (known after apply)
08:09:13.765 STDOUT terraform:       + microservice-b = (known after apply)
08:09:13.765 STDOUT terraform:     }
08:09:13.765 STDOUT terraform:   + repositories_urls = {
08:09:13.765 STDOUT terraform:       + microservice-a = (known after apply)
08:09:13.765 STDOUT terraform:       + microservice-b = (known after apply)
08:09:13.765 STDOUT terraform:     }
```

💰 Infracost estimate for `sbx/eu-west-1/ecr`
```
Project: main

 Name                                                   Monthly Qty  Unit            Monthly Cost   
                                                                                                    
 aws_ecr_repository.ecr_repository["microservice-a"]                                                
 └─ Storage                                           Monthly cost depends on usage: $0.10 per GB   
                                                                                                    
 aws_ecr_repository.ecr_repository["microservice-b"]                                                
 └─ Storage                                           Monthly cost depends on usage: $0.10 per GB   
                                                                                                    
 OVERALL TOTAL                                                                             $0.00 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
4 cloud resources were detected:
∙ 2 were estimated
∙ 2 were free

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main                                               ┃         $0.00 ┃           - ┃      $0.00 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛
```
